#include <stdio.h>

int main()
{
    printf("Homeplus\n\n");
    printf("교환/환불/결제변경은 구매 점포에서\n한달이내 가능(신선은 7일 이내)\n단, 정상(미사용)상품, 영수증/결제카드지참\n\n");
    printf("%-10s %-6s %-3s\t %10s %-4s %7s %-3s\n", 
	        "2022/02/06", "19:38:46", "[일]", "TM:", "000101", "NO:","0265");
	printf("---------------------------------------------------------------\n");
	printf("%-40s %-10s %-6s %-20s\n", "상품명", "단가", "수량","금액");
    printf("---------------------------------------------------------------\n");
	printf("%-40s %-10d %-6d %-20d\n","01 클라우드캔500ML",1900,2,3800); 
	printf("%-40s %-10d %-6d %-20d\n\n","02 고량주플러스250",9000,1,9000);
	printf("%30s %5s\n", "과세물품", "11,637");
	printf("%30s %5s\n", "부가세", "1,637");
	printf("---------------------------------------------------------------\n"); 
	printf("%-25s %37s\n", "구매금액","12,800"); 
	printf("%-25s %37s\n", "4BC체크카드(우리)","5397-20**-8***-7564 85"); 
	printf("%-25s %37s\n", "카드결제 :","12,800");
	printf("%-25s %37s\n", "할부개월 : 일시불","승인번호: 61048965");
	printf("---------------------------------------------------------------\n");
	printf("%-25s\n", "양*희(0753-00**-****-6493)");
	printf("%-25s %37s\n", "적립포인트","12점"); 
	printf("%-25s %37s\n", "보유/가용","3,123/3,111점");
    printf("포인트 유효기간은 적립월 기준 2년입니다.\n");
    printf("1/5부터 전화번호로 포인트 사용이 불가합니다\n멤버십앱을 통해 사용가능하니 설치바랍니다\n"); 
    printf("---------------------------------------------------------------\n");
    printf("%-10s %-20s %18s %10s\n", "계산원: ","POS101","대표번호: ","031)756-8545"); 
	
	
	
	return 0;
}

